Repository: saibel203/MethodicalSupportDisciplines
Catalog: src/MethodicalSupportDisciplines.Shared/Resources/ViewModels/Forms/AssignRoles/CreateStudentViewModel.*.resx
Languages: uk

# FormatLearningFieldName
source: Format learning
uk: Формат навчання

# LearningStatusFieldName
source: Learning status
uk: Статус навчання

# FacultyFieldName
source: Faculty
uk: Факультет

# SpecialityFieldName
source: Speciality
uk: Спеціальність

# GroupFieldName
source: Group
uk: Група

# FormatLearningRequired
source: The 'Format learning' field is required
uk: Поле 'Формат навчання' є обов'язовим для заповнення

# LearningStatusRequired
source: The 'Learning status' field is required
uk: Поле 'Статус навчання' є обов'язовим для заповнення

# FacultyRequired
source: The 'Faculty' field is required
uk: Поле 'Факультет' є обов'язовим для заповнення

# SpecialtyRequired
source: The 'Speciality' field is required
uk: Поле 'Спеціальність' є обов'язовим для заповнення

# GroupRequired
source: The 'Group' field is required
uk: Поле 'Група' є обов'язовим для заповнення
