Repository: saibel203/MethodicalSupportDisciplines
Catalog: src/MethodicalSupportDisciplines.BLL/Resources/Services/AuthService.*.resx
Languages: uk

# UserWithEmailNotFound
source: The user with the specified e-mail address was not found
uk: Користувача із вказаною електронною поштою не знайдено

# MethodGetIncorrectData
source: The method received an incorrect value, possibly null
uk: Метод отримав неправильне значення, можливо, null

# ErrorTryCreateAccount
source: An error occurred while trying to create a new user
uk: Під час спроби створити нового користувача сталася помилка

# UserWithoutEmail
source: The user does not have an Email
uk: Користувач не має електронної пошти

# ErrorGetRole
source: Failed to get 'guest' user role
uk: Не вдалося отримати роль користувача "guest".

# RegisterSuccess
source: User created successfully
uk: Користувача створено успішно

# UnknownRegisterError
source: An unknown error occurred while trying to register a new user
uk: Під час спроби зареєструвати нового користувача сталася невідома помилка

# ConfirmEmailError
source: Before logging in, go to your email and confirm your identity
uk: Перед входом перейдіть до своєї електронної пошти та підтвердьте свою особу

# PasswordForEmailIncorrect
source: The password of the user with the specified Email is incorrect
uk: Пароль користувача з указаною електронною поштою неправильний

# LoginSuccess
source: The user has successfully logged in
uk: Користувач успішно авторизувався

# LoginUnknownError
source: An unknown error occurred while trying to log the user in
uk: Під час спроби входу користувача сталася невідома помилка

# NoUserWithId
source: No user with the given ID was found
uk: Користувач із вказаним ідентифікатором не знайдений

# ConfirmEmailUnknownError
source: An error occurred while trying to confirm your email
uk: Під час спроби підтвердити вашу електронну адресу сталася помилка

# ConfirmSuccess
source: Email has been successfully verified
uk: Електронну пошту успішно підтвердженно

# ConfirmError
source: An unknown error occurred while trying to confirm Email
uk: Під час спроби підтвердити електронну адресу сталася невідома помилка

# RemindSuccess
source: The password change request was successfully sent to the specified e-mail address
uk: Запит на зміну пароля успішно надіслано на вказану адресу електронної пошти

# RemindUnknownError
source: An unknown error occurred while trying to send an email to change the password
uk: Під час спроби надіслати електронний лист для зміни пароля сталася невідома помилка

# PasswordsMatchError
source: NewPassword, ConfirmNewPassword fields do not match
uk: Паролі NewPassword, ConfirmNewPassword не співпадають

# ResetPasswordError
source: An error occurred while trying to change the password
uk: Під час спроби змінити пароль, виникла помилка

# ResetPasswordSuccess
source: Password changed successfully
uk: Пароль успішно змінено

# ResetPasswordUnknownError
source: An unknown error occurred while trying to change the password
uk: Під час спроби змінити пароль, виникла невідома помилка
