Repository: saibel203/MethodicalSupportDisciplines
Catalog: src/MethodicalSupportDisciplines.MVC/Resources/Views/Home/Index.*.resx
Languages: uk

# Title
source: Home page
uk: Головна сторінка

# ContentTitle
source: Welcome to the "Methodological support of disciplines" system
uk: Вітаємо Вас у системі «Методичне забезпечення дисциплін»

# MainSubtitle
source: Dear visitors of the system!
uk: Шановні відвідувачі системи!

# EndSubtitle
source: Sincerely, the Development Team of this site
uk: З повагою, Команда Розробників даного сайту

# GenericInformation
source: This site is designed to automate the management of teaching materials (textbooks, files, websites) by teachers, monitor their progress, interactions between teachers and students, and maintain the results of ongoing monitoring.
uk: Даний сайт призначения для автоматизація веденя вчителями методичних забезпечень (видання підручників, файлів, сайтів), контролювання їх проходження, взаємодії між вчителями та студентами та ведення результатів поточного контролю.

# HelpInformation
source: If you have any questions about training or the system's operation, please contact the developers at <a href="mailto: saibl.og203@gmail.com">saibl.og203@gmail.com</a>.
uk: Якщо виникли питання щодо навчання або роботи системи, пишіть на електронну пошту розробників: saibl.og203@gmail.com

# ExceptionRoleString
source: Role identification error. You may be logged in to a test account or the system has failed.
uk: Помилка ідентифікації ролі. Можливо ви увійшли у тестовий акаунт, або система дала збій.

# AdminMainString
source: This role is intended for the overall management of all system processes. You have access to managing users, deleting them, and can send them requests to change their data if you find faults in the table. Also, you have access to managing course groups, their formalization, and access to all the training materials that teachers provide to students.
uk: Дана роль призначена для загального управління всіми процесами системи. Ви маєте доступ до управління користувачами, їх видалення, можете надсилати їм запити на зміну їх даних, якщо виявили у таблиці несправності. Також, маєте доступ до управління групами курсів, їх формалізації та доступом до всіх навчальних матеріалів, які викладачі надають студентам.

# GuestMainString
source: You have the role of a guest, and to use the system further, you need to wait until the administrator gives you another role - student or teacher.
uk: Ви маєте роль гостя, для подальшого використання системи, вам потрібно чекати, поки адмін надасть вам інакшу роль - студента або вчителя.

# StudentMainString
source: This role is intended for
uk: Дана роль призначена для

# TeacherMainString
source: This role is intended for
uk: Дана роль призначена для
