Repository: saibel203/MethodicalSupportDisciplines
Catalog: src/MethodicalSupportDisciplines.MVC/Resources/Views/Teacher/DisciplineData.*.resx
Languages: uk

# Title
source: Information about the discipline
uk: Інформація про дисципліну

source: Teacher
uk: Вчитель

source: Created date
uk: Дата створення

source: Material path
uk: Вкажіть матеріал

# CreateMaterial
source: Create
uk: Створити

# LinksTitle
source: Links
uk: Посилання

# FilesTitle
source: Books & Files
uk: Книги та файли

source: Download file
uk: Завантажити файл

source: Open link
uk: Відкрити посилання

source: Remove material
uk: Видалити матеріал

source: New discipline material
uk: Новий матеріал для дисципліни

# NewDisciplineMaterialPlaceholderName
source: Discipline material name
uk: Назва матеріалу

# NewDisciplineMaterialPlaceholderDescription
source: Discipline material description
uk: Опис матеріалу

source: Close
uk: Закрити

# NewMaterialDisciplineMaterial
source: New material
uk: Добавити матеріал

source: Remove discipline material
uk: Видалити матеріал
