Repository: saibel203/MethodicalSupportDisciplines
Catalog: src/MethodicalSupportDisciplines.BLL/Resources/IdentityErrors.*.resx
Languages: uk

# EmailAlreadyTaken
source: Email '{0}' is already taken
uk: Email '{0}' вже зайнятий

# UsernameAlreadyTaken
source: Username '{0}' is already taken
uk: Username '{0}' вже зайнятий

# InvalidEmail
source: Email '{0}' is invalid
uk: Email '{0}' недійсний

# RoleAlreadyTaken
source: Role name '{0}' is already taken
uk: Role name '{0}' вже зайнято

# InvalidRoleName
source: Role name '{0}' is invalid
uk: Role name '{0}' недійний

source: Invalid token
uk: Неприпустимий токен

# InvalidUserName
source: Username '{0}' is invalid, can only contain letters or digits
uk: Username "{0}" недійсне, може містити лише літери або цифри

# ConcurrencyFailure
source: An unknown failure has occurred
uk: Сталася невідома помилка

# DefaultError
source: Email '{0}' is already taken
uk: Email '{0}' вже зайнятий

# LoginAlreadyAssociated
source: A user with this login already exists
uk: Користувач із таким логіном вже існує

# PasswordMismatch
source: Incorrect password
uk: Невірний пароль

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9')
uk: Паролі повинні містити принаймні одну цифру ('0'-'9')

# PasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z')
uk: Паролі повинні містити принаймні одну нижню літеру ('a'-'z')

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character
uk: Паролі повинні містити принаймні один не буквено-цифровий символ

# PasswordRequiresUniqueChars
source: Passwords must use at least {0} different characters
uk: Паролі мають містити принаймні {0} різних символів

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z')
uk: Паролі повинні містити принаймні одну велику літеру ('A'-'Z')

# PasswordTooShort
source: Passwords must be at least {0} characters
uk: Паролі мають містити принаймні {0} символів

# RecoveryCodeRedemptionFailed
source: User already has a password set
uk: Користувач уже має пароль

# UserAlreadyHasPassword
source: User already has a password set
uk: Користувач уже має пароль

# UserAlreadyInRole
source: User already in role '{0}'
uk: Користувач уже виконує роль '{0}'

# UserLockoutNotEnabled
source: Lockout is not enabled for this user
uk: Блокування не ввімкнено для цього користувача

# UserNotInRole
source: User is not in role '{0}'
uk: Користувач не в ролі '{0}'
