Repository: saibel203/MethodicalSupportDisciplines
Catalog: src/MethodicalSupportDisciplines.Data/Resources/Repositories/Learning/DisciplineRepository.*.resx
Languages: uk

# DisciplineNotFound
source: Discipline with the specified ID was not found
uk: Дисципліну з заданим ID не знайдено

# NotDisciplineOwner
source: It's impossible to switch. You do not belong to the discipline with the specified ID
uk: Неможливо перейти. Ви не є властинок дисципліни з вказаним ID

# DisciplineGetUnknownError
source: An unknown error occurred while trying to retrieve a discipline with the specified ID
uk: Під час спроби отримани дисципліну з вказаним ID, виникла невідома помилка

# DisciplineGetSuccess
source: Discipline successfully getten
uk: Дисципліну успішно отимано

# CreateUnknownError
source: An unknown error occurred while trying to create a new discipline
uk: Під час спроби створити нову дисципліну, виникла невідома помилка

# CreateSuccess
source: Discipline successfully created
uk: Дисципліну успішно створено

# DisciplinesForAdminUnknownError
source: An unknown error occurred while trying to retrieve information about disciplines from the database
uk: При спробі отримати інформацію про дисципліни з бази даних, виникла невідома помилка

# DisciplinesForAdminSuccess
source: List of disciplines successfully received
uk: Список дисциплін успішно отримано

# DisciplinesUnknownError
source: An unknown error occurred while trying to retrieve information about available disciplines from the database
uk: При спробі отримати інформацію про дисципліни з бази даних, виникла невідома помилка

# DisciplinesSuccess
source: List of disciplines successfully received
uk: Список дисциплін успішно отримано

# RemoveDisciplineUnknownError
source: An unknown error occurred while trying to retrieve and delete a discipline from the database
uk: Під час спроби отримати та видалити дисципліну з бази даних, виникла невідома помилка

# RemoveDisciplineSuccess
source: Discipline successfully removed
uk: Дисципліну успішно видалено

source: User not found
uk: Користувача не знайдено

# SuccessGetDisciplinesForUser
source: Disciplines for the user successfully obtained
uk: Дисципліни для користувача успішно отримано

# UnknownErrorGetDisciplinesForUser
source: An unknown error occurred while trying to obtain discipline
uk: Під час спроби отримати список дисциплін, виникла невідома помилка

# NotStudentDiscipline
source: The group of this student is not tied to the chosen discipline
uk: Група даного студента не прив'язана до обраної дисципліни

# SuccessGetDisciplineForStudent
source: Discipline successfully obtained
uk: Дисципліну успішно отримано

# UnknownErrorGetDisciplineForStudent
source: An unknown error occurred while trying to obtain discipline
uk: Під час спроби отримати дисципліну, виникла невідома помилка
